src/Tasks/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Взаимодействие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительФактический</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействияСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСостоялось</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереносов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеПредставление</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокИсходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОнлайнЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыНапоминаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНапоминаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСобытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаВремяОтносительноСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПосещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВМоментСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТолькоРоссийский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьВводНекорректного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Tasks/Взаимодействие/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет") Тогда
		Объект.Контрагент = Параметры.Предмет;
	КонецЕсли;
	// Инициализация реквизитов при открытии.
	ИнициализацияФормы();
	СоздатьВиджетСделки(); 
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ" Тогда	
		СоздатьВиджетСделки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗадачаИзменена = ЭтотОбъект.Модифицированность;
	Объект.Выполнена = ЭтотОбъект.ВзаимодействиеВыполнено;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Заполним параметры напоминания		
	Задачи.Взаимодействие.ЗаполнитьПараметрыНапоминания(ТекущийОбъект, Новый Структура("ЗадачаРежимНапоминания", ЭтотОбъект.ЗадачаРежимНапоминания));	
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ПараметрыЗаписи.Вставить("ЭтоНовый", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗадачаИзменена Или ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ЭтоНовый", Ложь) Тогда
		Оповестить("ОбновитьСписокЗадачМенеджера", Объект.Ссылка);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Сделка) Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Задача"			, Объект.Ссылка);
		ПараметрыОповещения.Вставить("Сделка"			, Объект.Сделка);
		ПараметрыОповещения.Вставить("УдалениеЗадачи"	, (Объект.Выполнена Или Объект.ПометкаУдаления));
		
		Оповестить("ОбновитьЗадачуКанбан", ПараметрыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события формы "ОбработкаПроверкиЗаполненияНаСервере".
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Если задача не выполнена - проверяем заполнение
	Если Не Объект.Выполнена Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.ВидВзаимодействияСправочник) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Укажите вид взаимодействия.';en='Specify view interactions.'"), Объект.Ссылка, "Объект.ВидВзаимодействияСправочник");
			Отказ = Истина;
		КонецЕсли;	
		
		// Если Не ЗначениеЗаполнено(Объект.ЗадачаПредмет) Тогда 
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите предмет задачи.", ЭтотОбъект, "Объект.ЗадачаПредмет");
		//	Отказ = Истина;
		// КонецЕсли;	
		
		Отказ = Не ПроверитьПравильностьПериода();	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
// Процедура - Вид взаимодействия справочник при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВидВзаимодействияСправочникПриИзменении(Элемент)
	
	Объект.ВидВзаимодействия = ВернутьТипВзаимодействия(Объект.ВидВзаимодействияСправочник);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача назначенная дата очистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗадачаНазначеннаяДатаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача назначенная дата время при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаНазначеннаяДатаВремяПриИзменении(Элемент)
	
	Объект.ЗадачаНазначеннаяДата = ЗадачаНазначеннаяДатаВремя;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача назначенная дата при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаНазначеннаяДатаПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораВремениЗадачи("ЗадачаНазначеннаяДата");	
	ЗадачаНазначеннаяДатаВремя = Объект.ЗадачаНазначеннаяДата;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача назначенная дата начала время при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаНазначеннаяДатаНачалоВремяПриИзменении(Элемент)
	
	Объект.ЗадачаНазначеннаяДатаНачало = ЗадачаНазначеннаяДатаНачалоВремя;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача назначенная дата время очистка
//
// Параметры:
//  Элемент				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ЗадачаНазначеннаяДатаВремяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполянет завершение редактирования клиента.
//
Процедура ЗавершениеДополнительнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	
	СформироватьКонтаргентаСтрокой(Элементы.КнопкаКонтрагент.Заголовок, Объект.Контрагент);
	СформироватьПредметСтрокой(Элементы.КнопкаПредмет.Заголовок, Объект.ЗадачаПредмет);
	
	Если ДополнительныеПараметры.ДанныеЭлемента = Неопределено Тогда 
		ОбновитьВидимостьЭлементов();
	Иначе 
		ОбновитьЭлементы_CRM(, , Истина);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие исполнитель
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВзаимодействиеИсполнитель(Команда)
	
	Оповещение     = Новый ОписаниеОповещения("ОбработчикВыбораИсполнителя", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ"							, Объект.Исполнитель);
	ПараметрыФормы.Вставить("ВыборТолькоЭлементов"			, Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"			, Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"	, Истина);
	
	ОткрытьФорму("Задача.Взаимодействие.Форма.ФормаВыбораИсполнителя", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обработчик выбора исполнителя взаимодействия
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ОбработчикВыбораИсполнителя(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.Исполнитель = Результат;
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.Сотрудники") Тогда
			Элементы.ВзаимодействиеИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(Объект.Исполнитель);
		Иначе
			 Элементы.ВзаимодействиеИсполнитель.Заголовок = Строка(Результат);
		КонецЕсли;
			
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие выбрать.
//
Процедура ВидВзаимодействияСправочникВыбор(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВидаВзаимодействияСправочникЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВидВзаимодействияСправочникВыбор);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение.
//
Процедура ВыборВидаВзаимодействияСправочникЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Элементы.ДекорацияВзаимодействиеИконка.Картинка     = Результат.Картинка;
		Элементы.ДекорацияВзаимодействиеИконка.Видимость    = ЗначениеЗаполнено(Результат.Картинка);
		Элементы.ВидВзаимодействияСправочникВыбор.Заголовок = Результат.Представление;
		
		Объект.ВидВзаимодействияСправочник = Результат.Значение.Взаимодействие;
		Объект.ВидВзаимодействия           = Результат.Значение.ВидВзаимодействия;
		
		Модифицированность = Истина;
		
		УстановитьЗаголовокФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда взаимодействие режим напоминания.
//
Процедура ВзаимодействиеРежимНапоминания(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеРежимНапоминания);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор взаимодействия завершение
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ЗадачаРежимНапоминания = Результат.Значение;
		Элементы.ВзаимодействиеРежимНапоминания.Заголовок = Результат.Представление; 

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Записать и закрыть.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ПроверитьЗаполнение() Тогда		
		Записать();
		Закрыть(); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Позвонить
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Позвонить(Команда)
	
	Возврат;
	// ТелефонКлиента = УправлениеКонтактнойИнформациейСлужебныйВызовСервераСтоматология.КонтактнаяИнформацияОбъекта(ЭтотОбъект.Клиент, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКлиента"));
	//IPТелефонияКлиент.ИсходящийЗвонокОсуществитьПоКонтрагенту(ЭтотОбъект.Клиент, ТелефонКлиента);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переключение состояния взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключениеСостояния(Команда)

	ЭтотОбъект.ВзаимодействиеВыполнено = Не ЭтотОбъект.ВзаимодействиеВыполнено;
	
	Модифицированность = Истина;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда предмет нажатие
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура КомандаКонтрагентНажатие(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда	
		Оповещение = Новый ОписаниеОповещения("КонтрагентНажатиеЗавершение", ЭтотОбъект); 
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбораКлиенты", Новый Структура("МножественныйВыбор", Ложь), ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе		                         
		ПоказатьЗначение(, Объект.Контрагент);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Команда предмет нажатие
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура КомандаПредметНажатие(Команда)

	Если ЗначениеЗаполнено(Объект.ЗадачаПредмет) Тогда		
		ПоказатьЗначение(, Объект.ЗадачаПредмет);	
	КонецЕсли;
	
КонецПроцедуры


#Область _______________________ПОДКЛЮЧАЕМЫЕ_ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ_________________________

//&НаКлиенте
//// Обработчик открытия формы кэш списка вводимых значений
////
// Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
//	
//	СтандартнаяОбработка = Ложь;
//	СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент,ЭтаФорма);
//	
// КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ГиперСсылкаДополнитьИнформациюОКлиентеНажатие".
//
Процедура Подключаемый_ДополнитьИнформациюОКлиенте_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	// Запись в журнал регистрации
	// Необходимо для выявления редкой ошибки
	ЗаписатьВЖурналВсеПараметры(?(НЕ ЗначениеЗаполнено(Объект.ЗадачаПредмет), " Пациент не указан!", ""));
		
	Если ЗначениеЗаполнено(Объект.ЗадачаПредмет) Тогда 
		Если ТипЗнч(Объект.ЗадачаПредмет) = Тип("СправочникСсылка.Контрагенты") Тогда			
			ПараметрыФормы = Новый Структура;
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатусКлиента)
				ИЛИ ЭтотОбъект.СтатусКлиента = ПредопределенноеЗначение("Перечисление.СтатусыКонтрагентов.Потенциальный") Тогда 
				УстановитьСтатусКонтрагенту(Объект.ЗадачаПредмет);
				СформироватьКонтаргентаСтрокой(Элементы.КнопкаКонтрагент.Заголовок, Объект.Контрагент);
				СформироватьПредметСтрокой(Элементы.КнопкаПредмет.Заголовок, Объект.ЗадачаПредмет);				
				ПараметрыФормы.Вставить("РедактироватьФИО", Истина);
			КонецЕсли;			
		КонецЕсли;
		Если ТипЗнч(Объект.ЗадачаПредмет) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыФормы.Вставить("Ключ", Объект.ЗадачаПредмет);			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеДополнительнойИнформации", ЭтотОбъект, СтруктураДанныеЭлемента);
			ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, Элементы.Предмет, , , , ОписаниеОповещения, );// РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Иначе
			ПоказатьЗначение(, Объект.ЗадачаПредмет);			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый декорация формы удалить текущее взаимодействие нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_УдалитьТекущееВзаимодействие_ВыполнитьКоманду(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущиеВзаимодействия.Удалить(СтруктураДанныеЭлемента.ДанныеЭлемента);
	АктивизироватьСледующийЭлементНаФорме(Элементы.КнопкаСледующееВзаимодействие_Изменить);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Развернуть свернуть подробную информацию по задаче
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Подключаемый_Развернуть_Свернуть_ПодробнуюИнформацию_По_Задаче(Команда)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Команда);
	
	Если СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппаСКраткойИнформацией 	= Элементы.Найти("Группа_Общая_Краткая_Информация_По_Задаче_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
	ГруппаСПодробнойИнформацией = Элементы.Найти("Группа_Общая_Подробная_Информация_По_Задаче_" + Строка(СтруктураДанныеЭлемента.ИндексСтроки));
	
	Если НЕ ГруппаСКраткойИнформацией = Неопределено И НЕ ГруппаСПодробнойИнформацией = Неопределено Тогда 
		ГруппаСКраткойИнформацией.Видимость 	= НЕ ГруппаСКраткойИнформацией.Видимость;
		ГруппаСПодробнойИнформацией.Видимость 	= НЕ ГруппаСКраткойИнформацией.Видимость;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Подключаемый декорация формы представление задачи первая строка тема нажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура Подключаемый_ДекорацияФормы_Представление_Задачи_Тема_Нажатие(Элемент)
	
	СтруктураДанныеЭлемента = УправлениеСвойствамиКлиентСтоматология.ПолучитьДанныеЭлемента(ЭтаФорма, Элемент);
	
	Если СтруктураДанныеЭлемента.ДанныеЭлемента = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(СтруктураДанныеЭлемента.ДанныеЭлемента.Задача));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОповещенийАсинхронныхСобытий

&НаКлиенте
// Процедура, завершает выбор клиента.
//
Процедура КонтрагентНажатиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.Контрагент = Результат;
		ЭтотОбъект.Клиент = Результат;
		СформироватьКонтаргентаСтрокой(Элементы.КнопкаКонтрагент.Заголовок, Объект.Контрагент);
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область Виджет

&НаСервере
// Процедура, СоздатьВиджетСделки.
//
Процедура СоздатьВиджетСделки()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) 
		И ЗначениеЗаполнено(Объект.Сделка) Тогда
		
		УправлениеИнтерфейсамиСервер.ОбновитьВиджетСделки(ЭтаФорма, Объект.Контрагент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатиДинамическогоЭлементаВиджета.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатиДинамическогоЭлементаВиджета(Команда) Экспорт
   
	Если СтрНайти(Команда.Имя, "КомандаТекущийЭтап") > 0 Тогда
		
		ИндексГурппы = ПолучитьИндексСтроки(Команда.Имя);	
			
		Если Элементы["ГруппаПричиныОтказа_" + ИндексГурппы].Видимость
			ИЛИ Элементы["ГруппаПрием_"+ ИндексГурппы].Видимость Тогда
			
			Элементы["ГруппаЭтапы_" + ИндексГурппы].Видимость   	  = Истина;
			Элементы["ГруппаПричиныОтказа_" + ИндексГурппы].Видимость = Ложь;
			Элементы["ГруппаПрием_"+ ИндексГурппы].Видимость	  = Ложь;
			
		КонецЕсли;

		СменитьФокусЭлемента(ИндексГурппы);

		Элементы["ГруппаВсплывающая_" + ИндексГурппы].Показать(); 
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаСделка") Тогда 
		
		ИндексСтроки  = ПолучитьИндексСтроки(Команда.Имя);
		СтрокаТаблицы = ЭтаФорма.ТаблицаСделок[ИндексСтроки];
		
		ПоказатьЗначение(,СтрокаТаблицы.Сделка);
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаОткрытьПродажу") Тогда 
		
		ИндексСтроки = ПолучитьИндексСтроки(Команда.Имя);
		Реализация   = ЭтаФорма.ТаблицаСделок[ИндексСтроки].Прием;
		
		Если ЗначениеЗаполнено(Реализация) Тогда
			ПоказатьЗначение(,Реализация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикНажатияИзменитьЭтап.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ОбработчикНажатияИзменитьЭтап(Команда) Экспорт
	
	ИндексВиджета = ПолучитьИндексСтроки(Команда.Имя, Ложь);
	
	Если СтрНайти(Команда.Имя, "КомандаИзменитьЭтапОтказ") > 0 Тогда
		  				
		Элементы["ГруппаЭтапы_" + ИндексВиджета].Видимость   	   = НЕ Элементы["ГруппаЭтапы_" + ИндексВиджета].Видимость;
		Элементы["ГруппаПричиныОтказа_" + ИндексВиджета].Видимость = НЕ Элементы["ГруппаПричиныОтказа_" + ИндексВиджета].Видимость;
		СменитьФокусЭлемента(ИндексВиджета);
		// Элементы["ГруппаВсплывающая_" + ИндексВиджета].Показать();
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаИзменитьЭтапУспех") > 0 Тогда
		  				
		Элементы["ГруппаЭтапы_" + ИндексВиджета].Видимость   	   = Ложь;
		Элементы["ГруппаПричиныОтказа_" + ИндексВиджета].Видимость = Ложь;
		Элементы["ГруппаРеализация_" + ИндексВиджета].Видимость    = Истина;
		СменитьФокусЭлемента(ИндексВиджета);
		Элементы["ГруппаВсплывающая_" + ИндексВиджета].Показать();
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаСоздатьПродажу") > 0 Тогда
		
		Сделка = ЭтаФорма.ТаблицаСделок[ИндексВиджета].Сделка;
		
		Структура = Новый Структура();
		Структура.Вставить("Контрагент", Объект.Контрагент);
		Структура.Вставить("Сделка"	   , Сделка);
		ПараметрыФормы  = Новый Структура("ЗначенияЗаполнения", Структура);	
		НовоеОповещение = Новый ОписаниеОповещения("СоздатьРеализациюЗавершение", ЭтотОбъект, Сделка);
		СменитьФокусЭлемента(ИндексВиджета);
		ОткрытьФорму("Документ.Прием.Форма.ФормаДокумента",ПараметрыФормы,,,,,НовоеОповещение);
		
	ИначеЕсли СтрНайти(Команда.Имя, "КомандаВыбратьПродажу") > 0 Тогда
		
		Сделка = ЭтаФорма.ТаблицаСделок[ИндексВиджета].Сделка;
		МассивСделок = Новый Массив();
		МассивСделок.Добавить(Сделка);

		НовоеОповещение = Новый ОписаниеОповещения("ВыбратьРеализациюЗавершение", ЭтотОбъект, Сделка);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Контрагент", 			  Объект.Контрагент);
		ПараметрыФормы.Вставить("ВключатьПакетИЧленство", Истина);
		ПараметрыФормы.Вставить("РеализацияБезСделки"	, Истина);
		ПараметрыФормы.Вставить("МассивСделок"			, МассивСделок);

		ОткрытьФорму("Документ.Реализация.ФормаВыбора",ПараметрыФормы,,,,,НовоеОповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		СменитьФокусЭлемента(ИндексВиджета);
	
	Иначе
		
		СменитьФокусЭлемента(ИндексВиджета);
		ОбновитьСделку(Команда.Имя, Объект.Контрагент);
		Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
		Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
		
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
// Процедура, СоздатьРеализациюЗавершение.
//
Процедура СоздатьРеализациюЗавершение(Результат, ДопПараметры) Экспорт
		
	СоздатьРеализациюЗавершениеНаСервере(ДопПараметры);
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	
КонецПроцедуры

&НаСервере
// Процедура, СоздатьРеализациюЗавершениеНаСервере.
//
Процедура СоздатьРеализациюЗавершениеНаСервере(Сделка)
	
	Реализация = ПолучитьПоследнююПродажуПоСделке(Сделка);
	УправлениеИнтерфейсамиСервер.ОбновитьЭтапУспех(Сделка, Реализация);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, ВыбратьРеализациюЗавершение.
//
Процедура ВыбратьРеализациюЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;		
	КонецЕсли;
	
	ВыбратьРеализациюЗавершениеНаСервере(Результат, ДопПараметры);
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
	
КонецПроцедуры

&НаСервере
// Процедура, ВыбратьРеализациюЗавершениеНаСервере.
//
Процедура ВыбратьРеализациюЗавершениеНаСервере(Продажа, Сделка)
	
	УправлениеИнтерфейсамиСервер.ОбновитьЭтапУспех(Сделка, Продажа);
	
КонецПроцедуры

&НаКлиенте
// Процедура, ОбработчикТаблицаОтказовВыбор.
//
Процедура ОбработчикТаблицаОтказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ПричинаОтказа = Элемент.ТекущиеДанные.Ссылка;
	ИмяЭлемента   = Элемент.Имя;
	
	ИндексВиджета = ПолучитьИндексСтроки(ИмяЭлемента, Ложь);
	СменитьФокусЭлемента(ИндексВиджета);
	
	ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента);	
	Оповестить("ОБНОВИТЬ_ЭТАПЫ_СДЕЛКИ");
	Оповестить("ОБНОВИТЬ_ВИДЖЕТ_СДЕЛКИ");
    
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьПричинуОтказаВыборНаСервере.
//
Процедура ОбновитьПричинуОтказаВыборНаСервере(ПричинаОтказа, ИмяЭлемента)	
	
	УправлениеИнтерфейсамиСервер.ОбновитьПричинуОтказа(ЭтаФорма, ПричинаОтказа, ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
// Процедура, ОбновитьСделку.
//
Процедура ОбновитьСделку(ИмяКоманды, Контрагент)
		
	Если СтрНайти(ИмяКоманды, "КомандаЭтап") > 0 Тогда	
		
		ИндексВиджета 	= ПолучитьИндексСтроки(ИмяКоманды, Ложь);
		ИндексЭтапа     = ПолучитьИндексСтроки(ИмяКоманды);
		НайденнаяСделка = ЭтотОбъект.ТаблицаСделок[ИндексВиджета].Сделка;
		
		УправлениеИнтерфейсамиСервер.ОбновитьЭтапСделки(НайденнаяСделка, ИндексЭтапа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает идентификатор строки данных по имени элемента.
//
// Параметры:
//	 ИмяЭлемента 	- Строка - имя элемента.
//   ИндексЭлемента - Булево - признак чего получаем индекс (Элемента или Виджета).
//
Функция ПолучитьИндексСтроки(ИмяЭлемента, ИндексЭлемента = Истина)
	
	Если ИндексЭлемента Тогда
		НомерСимвола = СтрНайти(ИмяЭлемента,"_");
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	Иначе
		НомерСимвола = СтрНайти(ИмяЭлемента,"_", НаправлениеПоиска.СКонца);
		Возврат Число(Сред(ИмяЭлемента, НомерСимвола + 1, 1));
	КонецЕсли;
	 	
КонецФункции

&НаКлиенте
// Процедура, СменитьФокусЭлемента.
Процедура СменитьФокусЭлемента(Знач ИндексГурппы)
	
	ЭтаФорма.ТекущийЭлемент = Элементы["КнопкаТекущийЭтап_" + ИндексГурппы];

КонецПроцедуры

&НаСервереБезКонтекста
// Функция, ПолучитьПоследнююПродажуПоСделке.
//
Функция ПолучитьПоследнююПродажуПоСделке(Сделка)
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Реализация.Ссылка КАК Продажа
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Сделка = &Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.Дата УБЫВ";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначениеВозврата = ?(Выборка.Следующий(), Выборка.Продажа, Неопределено);
	
	Возврат ЗначениеВозврата;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура - Инициализация формы.
//
Процедура ИнициализацияФормы()
		
	Если НЕ ЗначениеЗаполнено(Объект.ЗадачаТема) Тогда 
		Объект.ЗадачаТема = НСтр("ru = 'Без темы'; en = 'No subject'");
	КонецЕсли;
	
	// Задает вид взаимодействия по умолчанию
	Если Объект.Ссылка.Пустая() Тогда 
		
		Если Не ЗначениеЗаполнено(Объект.ВидВзаимодействияСправочник) Тогда 
			Объект.ВидВзаимодействияСправочник 	= Справочники.ВидыВзаимодействий.НайтиПоРеквизиту("ВидВзаимодействия", Перечисления.ВидыВзаимодействия.ЗвонокИсходящий);	
			ВидВзаимодействия 					= Объект.ВидВзаимодействияСправочник.ВидВзаимодействия;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДата) Тогда
			Объект.ЗадачаНазначеннаяДата = ОбщегоНазначенияСтоматология.ВернутьКратнуюТекущуюДатуСеанса(); 	
		КонецЕсли;
		
		// Заполнение реквизитов задачи из параметров при создании нового объекта.
		Если Параметры.Свойство("ИдентификаторСделки") Тогда
			Объект.Сделка = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ИдентификаторСделки));
		КонецЕсли;
		
		Если Параметры.Свойство("ИдентификаторКлиента") Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.ИдентификаторКлиента));
		КонецЕсли;
		
	КонецЕсли;		
	
	ЗадачаНазначеннаяДатаВремя       = Объект.ЗадачаНазначеннаяДата;
	ЗадачаНазначеннаяДатаНачалоВремя = Объект.ЗадачаНазначеннаяДатаНачало;
		
	// Заполним список выбора времени
	ЗаполнитьСписокВыбораВремениЗадачи("ЗадачаНазначеннаяДата");
	ЗаполнитьСписокВыбораВремениЗадачи("ЗадачаНазначеннаяДатаНачало");
	
	// Заполним список выбора времени напоминания.
	ЗаполнитьСписокВыбораРежимаНапоминания();
	ЗаполнитьСписокВыбораВзаимодействия();
	
	Если ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		Элементы.ВзаимодействиеИсполнитель.Заголовок = ПолучитьПредставлениеФИОСотрудника(Объект.Исполнитель);	
	Иначе
		Элементы.ВзаимодействиеИсполнитель.Заголовок = Строка(Объект.Исполнитель);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ДекорацияАвтор.Видимость = Истина;
		Если ЗначениеЗаполнено(Объект.ЗадачаАвтор) Тогда 
			ЭтоСлужебный = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЗадачаАвтор, "Служебный");
		Иначе 
			ЭтоСлужебный = Истина;
		КонецЕсли;	
		Если (ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") И Объект.Исполнитель = Объект.ЗадачаАвтор) ИЛИ ЭтоСлужебный = Истина Тогда 
			Элементы.ДекорацияАвтор.Заголовок = "(Создана: " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + ")";
		Иначе 
			Элементы.ДекорацияАвтор.Заголовок = "(Создана: " + Справочники.Сотрудники.ПолучитьСокращенноеНаименованиеСотрудника(, Объект.ЗадачаАвтор) + " " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + ")";
		КонецЕсли;
	Иначе 
		Элементы.ДекорацияАвтор.Видимость = Ложь;
	КонецЕсли;

	// Получим клиента
	Если Не ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.ЗадачаПредмет) 
		И (ТипЗнч(Объект.ЗадачаПредмет) = Тип("СправочникСсылка.Заявки")) Тогда
		ЭтотОбъект.Клиент = Объект.ЗадачаПредмет.ОсновнойКлиент;
	Иначе 
		ЭтотОбъект.Клиент = Объект.Контрагент;
	КонецЕсли;

	// Получим статус контрагента
	Если ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда 
		ЭтотОбъект.СтатусКлиента = Справочники.Контрагенты.ПолучитьСтатус(ЭтотОбъект.Клиент);
	КонецЕсли;
		
	ЭтотОбъект.ВзаимодействиеВыполнено = Объект.Выполнена;
	
	БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервереСтоматология(ЭтотОбъект, Объект, Элементы.ГруппаСостояние,, Ложь);
		
	ОбновитьВидимостьЭлементов(Истина);
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора времени выполнения задачи
//
Процедура ЗаполнитьСписокВыбораВремениЗадачи(ЗадачаДата)
	
	МассивПериодов = Новый Массив;
    СтруктураВремени               = ОбщегоНазначенияСтоматология.ПолучитьВремяРаботыСтруктурнойЕдиницы(Объект[ЗадачаДата], Объект.СтруктурнаяЕдиница);
	СтруктураВремени.ДатаНачала    = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаНачала), СтруктураВремени.ДатаНачала, Дата("00010101080000"));
	СтруктураВремени.ДатаОкончания = ?(ЗначениеЗаполнено(СтруктураВремени.ДатаОкончания), СтруктураВремени.ДатаОкончания, Дата("00010101220000"));
	
	МассивПериодов.Добавить(СтруктураВремени);	
	СписокВремени = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьСписокВремени(МассивПериодов, Истина, 30);	
	
	НазначеннаяДатаДень		= День(Объект[ЗадачаДата]);
	НазначеннаяДатаМесяц	= Месяц(Объект[ЗадачаДата]);
	НазначеннаяДатаГод		= Год(Объект[ЗадачаДата]);
	
	Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.Очистить();
	Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.Добавить(НачалоДня(Объект[ЗадачаДата]), Нстр("ru = 'Весь день'; en = 'Entire day'"));
	
	Для Каждого Элемент ИЗ СписокВремени Цикл	
	     Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.Добавить(Дата(НазначеннаяДатаГод, НазначеннаяДатаМесяц, НазначеннаяДатаДень,
		 				Час(Элемент.Значение), Минута(Элемент.Значение), Секунда(Элемент.Значение)), ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока( Элемент.Представление,,Новый Цвет(100, 100, 100))));
	КонецЦикла;
	
	ЭтаФорма[ЗадачаДата+"Время"] = Дата(НазначеннаяДатаГод, НазначеннаяДатаМесяц, НазначеннаяДатаДень,
						Час(ЭтаФорма[ЗадачаДата+"Время"]), Минута(ЭтаФорма[ЗадачаДата+"Время"]), Секунда(ЭтаФорма[ЗадачаДата+"Время"]));
						
	Если Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.НайтиПоЗначению(ЭтаФорма[ЗадачаДата+"Время"]) = Неопределено Тогда
		// Если не нашли в списке нашу дату
		Если ЗадачаНазначеннаяДатаВремя < Дата(Год(Объект[ЗадачаДата]), Месяц(Объект[ЗадачаДата]), День(Объект[ЗадачаДата]), Час(СтруктураВремени.ДатаНачала), Минута(СтруктураВремени.ДатаНачала), Секунда(СтруктураВремени.ДатаНачала)) Тогда 
			// Если наша дата меньше времени начала работы СЕ - корректируем по минимуму
			ЗадачаНазначеннаяДатаВремя = Дата(Год(Объект[ЗадачаДата]), Месяц(Объект[ЗадачаДата]), День(Объект[ЗадачаДата]), Час(СтруктураВремени.ДатаНачала), Минута(СтруктураВремени.ДатаНачала), Секунда(СтруктураВремени.ДатаНачала));
		ИначеЕсли ЗадачаНазначеннаяДатаВремя > Дата(Год(Объект[ЗадачаДата]), Месяц(Макс(Объект[ЗадачаДата], СтруктураВремени.ДатаОкончания)), День(Макс(Объект[ЗадачаДата], СтруктураВремени.ДатаОкончания)), Час(СтруктураВремени.ДатаОкончания), Минута(СтруктураВремени.ДатаОкончания), Секунда(СтруктураВремени.ДатаОкончания)) Тогда 
			// Если наша дата больше времени начала работы СЕ - корректируем по максимуму			
			ЗадачаНазначеннаяДатаВремя = Дата(Год(Объект[ЗадачаДата]), Месяц(Макс(Объект[ЗадачаДата], СтруктураВремени.ДатаОкончания)), День(Макс(Объект[ЗадачаДата], СтруктураВремени.ДатаОкончания)), Час(СтруктураВремени.ДатаОкончания), Минута(СтруктураВремени.ДатаОкончания), Секунда(СтруктураВремени.ДатаОкончания));
		Иначе 
			// Добавляем в список уникальную дату
			Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.Добавить(Объект[ЗадачаДата], Формат(Объект[ЗадачаДата], "ДФ=ЧЧ:мм"));
			// Сортируем
			Элементы.Найти(ЗадачаДата+"Время").СписокВыбора.СортироватьПоЗначению();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Заполнить список выбора взаимодействия.
//
Процедура ЗаполнитьСписокВыбораВзаимодействия()
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Очистить();
	
	ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора = Справочники.ВидыВзаимодействий.ПолучитьСписокВзаимодействий();
	
	Если ЗначениеЗаполнено(Объект.ВидВзаимодействияСправочник) Тогда                                     
		Для Каждого Взаимодействие Из ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора Цикл
			Если Взаимодействие.Представление = Объект.ВидВзаимодействияСправочник.Наименование Тогда
				
				Элементы.ДекорацияВзаимодействиеИконка.Картинка     = Взаимодействие.Картинка;
				Элементы.ДекорацияВзаимодействиеИконка.Видимость    = ЗначениеЗаполнено(Взаимодействие.Картинка);
				Элементы.ВидВзаимодействияСправочникВыбор.Заголовок = Взаимодействие.Представление;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
// Заполнить список выбора режима напоминания
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Очистить();
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(-1	 , Нстр("ru = 'не напоминать'; en = 'do not remind'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(0     , Нстр("ru = 'в момент события'; en = 'at the time of the event'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(300   , Нстр("ru = 'за 5 минут'; en = '5 minutes before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(600   , Нстр("ru = 'за 10 минут'; en = '10 minutes before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(900   , Нстр("ru = 'за 15 минут'; en = '15 minutes before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(1800  , Нстр("ru = 'за 30 минут'; en = '30 minutes before'"));     
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(3600  , Нстр("ru = 'за 1 час'; en = '1 hour before'"));
	ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(7200  , Нстр("ru = 'за 2 часа'; en = '2 hours before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(86400 , Нстр("ru = 'за 1 день'; en = '1 day before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(172800, Нстр("ru = 'за 2 дня'; en = '2 days before'"));
    ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.Добавить(604800, Нстр("ru = 'за 1 неделю'; en = '1 week before'"));
	
	Если Объект.НапоминаниеИспользовать = Истина Тогда 
		Если Объект.ВариантНапоминания = Перечисления.ВариантыНапоминаний.ЗаВремяОтносительноСобытия Тогда 
			ЭтотОбъект.ЗадачаРежимНапоминания = Объект.ЗадачаНазначеннаяДата - Объект.НапоминаниеДатаНачала;
		ИначеЕсли Объект.ВариантНапоминания = Перечисления.ВариантыНапоминаний.ПоПосещению Тогда
			ЭтотОбъект.ЗадачаРежимНапоминания = 1;
		Иначе 
			ЭтотОбъект.ЗадачаРежимНапоминания = -1;
		КонецЕсли;	
	Иначе 
		ЭтотОбъект.ЗадачаРежимНапоминания = -1;
	КонецЕсли;	
	
	НайденноеЗначение = ЭтотОбъект.ВзаимодействиеРежимНапоминанияСписокВыбора.НайтиПоЗначению(ЭтотОбъект.ЗадачаРежимНапоминания);
	Если НайденноеЗначение = Неопределено Тогда
		ЭтотОбъект.ЗадачаРежимНапоминания = -1;
		Элементы.ВзаимодействиеРежимНапоминания.Заголовок = Нстр("ru = 'не напоминать'; en = 'do not remind'")
	Иначе
		Элементы.ВзаимодействиеРежимНапоминания.Заголовок = НайденноеЗначение.Представление;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Процедура - Обновить элементы CRM
//
Процедура ОбновитьЭлементы_CRM(ОбновитьСписокБП = Истина, ПеречитатьСписокБП = Истина, ОбновитьЭлементыСтартаБП = Ложь)
	
	// Если ОбновитьЭлементыСтартаБП Тогда 
	// 	БизнесПроцессыИЗадачиСервер.ОбновитьЭлементы_CRM(ЭтаФорма, "ГруппаТекущиеВзаимодействия");
	// КонецЕсли;

	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура устанавливает контрагенту статус "Клиент клиники".
//
Процедура УстановитьСтатусКонтрагенту(Знач Контрагент)
	
	Справочники.Контрагенты.УстановитьСтатус(Контрагент, Перечисления.СтатусыКонтрагентов.Первичный);	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция получает статус контрагента.
//
Функция ПолучитьСтатусКонтрагента(Знач Контрагент)
	
	Возврат Справочники.Контрагенты.ПолучитьСтатус(Контрагент);	
	
КонецФункции

&НаСервереБезКонтекста
// Процедура формирует представление предмета.
//
Процедура СформироватьКонтаргентаСтрокой(КонтаргентСтрокой, Знач Контрагент, Знач СтатусКлиента = Неопределено, СтруктурнаяЕдиница = Неопределено)
	
	СтатусКлиента = ?(СтатусКлиента = Неопределено, Справочники.Контрагенты.ПолучитьСтатус(Контрагент), СтатусКлиента);
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		КонтаргентСтрокой = Нстр("ru = 'Контрагент не указан.'; en = 'Counterparty not selected.'");
	Иначе
		КонтаргентСтрокой = Строка(Контрагент)
							+ ?(ЗначениеЗаполнено(Контрагент.Телефон), Нстр("ru = ', тел. '; en = ', tel. '") + Контрагент.Телефон, "") 
							+ ?(ЗначениеЗаполнено(СтатусКлиента), " (" + Строка(СтатусКлиента) + ")", "");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Процедура формирует представление предмета.
//
Процедура СформироватьПредметСтрокой(ПредметСтрокой, Знач ЗадачаПредмет)
	
	Если ЗадачаПредмет = Неопределено ИЛИ ЗадачаПредмет.Пустая() Тогда
		ПредметСтрокой = Нстр("ru = 'Нет предмета задачи.'; en = 'No task subject.'");
	Иначе 						
		ПредметСтрокой = СокрЛП(Строка(ЗадачаПредмет));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура активизирует следующий необходимый элемент на форме
//
Процедура АктивизироватьСледующийЭлементНаФорме(Элемент)
	
	// ЭтаФорма.ТекущийЭлемент = Элемент;
		
КонецПроцедуры

&НаСервере
// Процедура - Обновить видимость элементов.
//
Процедура ОбновитьВидимостьЭлементов(ОбновитьДоступность = Ложь)
	
	// Значения по умолчанию.
	Элементы.ГруппаПредметПростойЗадачи.Видимость = Объект.Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Объект.ЗадачаПредмет);
	
	Элементы.КнопкаПозвонить.Видимость = ЗначениеЗаполнено(ЭтотОбъект.Клиент) И IPТелефония.ПроверитьВозможностьЗвонкаНаДанномПК()
                                         И ЗначениеЗаполнено(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЭтотОбъект.Клиент, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента));
	Элементы.Контрагент.Видимость 		= НЕ ЗначениеЗаполнено(ЭтотОбъект.Клиент) И НЕ ЗначениеЗаполнено(Объект.Ссылка);									 
	Элементы.КнопкаКонтрагент.Видимость = ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Клиент);									 									
	
	// Если задача выполнена.
	Если ЭтотОбъект.ВзаимодействиеВыполнено Тогда
		
		Элементы.ГруппаПереключениеСостояния.ЦветФона   = Новый Цвет(25, 116, 206);
		Элементы.КнопкаПереключениеСостояния.ЦветТекста	= Новый Цвет(255, 255, 255);		
		Элементы.КнопкаПереключениеСостояния.Заголовок	= Нстр("ru = 'Выполнена'; en = 'Completed'");
		
		Если ЗначениеЗаполнено(Объект.ИсполнительФактический) Тогда
			Элементы.ИсполнительФактический.Заголовок = ПолучитьПредставлениеФИОСотрудника(Объект.ИсполнительФактический) + " (" + Объект.ДатаИсполнения +")";
			Элементы.ИсполнительФактический.Видимость = Истина;
		КонецЕсли;
				
	Иначе
		
		Элементы.ГруппаПереключениеСостояния.ЦветФона   = Новый Цвет(242, 242, 242);
		Элементы.КнопкаПереключениеСостояния.ЦветТекста	= Новый Цвет(77, 77, 77);		
		Элементы.КнопкаПереключениеСостояния.Заголовок	= Нстр("ru = 'Выполнить'; en = 'Run'");		
		
	КонецЕсли;
	
	// Для пустого ЗадачиПредмет.
	Элементы.ГруппаПредмет.Видимость    = ЗначениеЗаполнено(Объект.ЗадачаПредмет);
	// Элементы.ГруппаКонтрагент.Видимость = ЗначениеЗаполнено(Объект.Контрагент) И Не ЗначениеЗаполнено(Объект.Сделка);
	
	СформироватьКонтаргентаСтрокой(Элементы.КнопкаКонтрагент.Заголовок, Объект.Контрагент, ЭтотОбъект.СтатусКлиента);
	СформироватьПредметСтрокой(Элементы.КнопкаПредмет.Заголовок, Объект.ЗадачаПредмет);
	
	// Срок период.
	ЭтотОбъект.РежимПериода = ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДатаНачало);
	ПереключательСрокПериод();
	
	УстановитьЗаголовокФормы();
	
	Если ОбновитьДоступность Тогда
		УстановитьДоступностьЭлементовПоПравам();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает доступность элементов формы.
//
Процедура УстановитьДоступностьЭлементовПоПравам()
	        // ПараметрыСеанса.ТекущийПользователь ПараметрыСеанса.ТекущийСотрудник
	ИсполнительЗадачи = ?(ЗначениеЗаполнено(Объект.ИсполнительФактический) И ЭтотОбъект.ВзаимодействиеВыполнено, Объект.ИсполнительФактический, Объект.Исполнитель);
	Если ТипЗнч(ИсполнительЗадачи) = Тип("СправочникСсылка.Сотрудники") Тогда 
		ЭтаЗадачаТекущегоПользователя = (ИсполнительЗадачи = ПараметрыСеанса.ТекущийСотрудник);
	Иначе 
		ЭтаЗадачаТекущегоПользователя = Ложь;
	КонецЕсли;
	
	Если ЭтотОбъект.ВзаимодействиеВыполнено
		И НЕ (РольДоступна(Метаданные.Роли.ПолныеПрава) 
		ИЛИ РольДоступна(Метаданные.Роли.ДобавлениеИзменениеКлиентов)) Тогда
		
		ОграничитьДоступЭлементов();
			
	КонецЕсли;
	
	Если ПравоДоступа("Редактирование", Метаданные.Задачи.Взаимодействие) = Ложь Тогда
		Элементы.КнопкаЗаписатьИЗакрыть.Доступность = Ложь;
	КонецЕсли;
	
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		
		Возврат; // Без органичений.
		
	// ИначеЕсли РольДоступна(Метаданные.Роли.ИзменениеВыполнениеЗадачДругихПользователей) Тогда
	//	
	//	// Давать возможно заполнять описание у чужих задач, если оно пустое.
	//	Если НЕ ЭтаЗадачаТекущегоПользователя
	//		И ЗначениеЗаполнено(Объект.ЗадачаОписание) Тогда
	//		
	//		Элементы.ГруппаСтрокаОписаниеЗадачи.ТолькоПросмотр 	= Истина;
	//		
	//	КонецЕсли;
	//	
	//	// Изменение всех полей, кроме темы и предмета у чужих не выполненных задач.
	//	Если НЕ ЭтаЗадачаТекущегоПользователя
	//		И НЕ ЭтотОбъект.ВзаимодействиеВыполнено Тогда
	//		
	//		Элементы.ГруппаСтрокаТемаЗадачи.ТолькоПросмотр 		= Истина;
	//		Элементы.ГруппаПредмет.ТолькоПросмотр 				= Истина;
	//		
	//	КонецЕсли;
	//	
	//	Если ЭтотОбъект.ВзаимодействиеВыполнено Тогда
	//		Элементы.КнопкаПереключениеСостояния.Доступность 	= Ложь; // Не менять состояние, если уже выполнена задача.
	//	КонецЕсли;
		
	ИначеЕсли РольДоступна(Метаданные.Роли.БазовыеПрава) Тогда
				
		// Ограничение РЛС и видимое ограничение элементов на форме.
		Если НЕ ЭтаЗадачаТекущегоПользователя Тогда
			
			ОграничитьДоступЭлементов();
			Элементы.ВидВзаимодействияСправочникВыбор.Доступность = Ложь;
			Элементы.КнопкаЗаписатьИЗакрыть.Доступность			  = Ложь;
			Элементы.ГруппаСтрокаОписаниеЗадачи.ТолькоПросмотр 	  = Истина;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, ОграничитьДоступЭлементов.
//
Процедура ОграничитьДоступЭлементов()
	
	// Ограничение элементов.
	Элементы.ГруппаСтрокаТемаЗадачи.ТолькоПросмотр 			= Истина;
	Элементы.ГруппаПериоды.ТолькоПросмотр 					= Истина;
	Элементы.ГруппаПредмет.ТолькоПросмотр 					= Истина;
	
	// Органичение кнопок.
	Элементы.КнопкаПереключениеСостояния.Доступность		= Ложь;
	Элементы.ВзаимодействиеРежимНапоминания.Доступность 	= Ложь;
	Элементы.ВзаимодействиеИсполнитель.Доступность			= Ложь;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает заголовок формы.
//
Процедура УстановитьЗаголовокФормы()
	
	ШаблонЗаголовка = "{Тема} ({ВидВзаимодействия}) {Состояние}";
	ШаблонЗаголовка = СтрЗаменить(ШаблонЗаголовка, "{Тема}"             , Объект.ЗадачаТема);
	ШаблонЗаголовка = СтрЗаменить(ШаблонЗаголовка, "{ВидВзаимодействия}", Строка(Объект.ВидВзаимодействия));
	
	Если Объект.Ссылка.Пустая() Тогда 
		ШаблонЗаголовка = СтрЗаменить(ШаблонЗаголовка, "{Состояние}", Нстр("ru = '(создание)'; en = '(creation)'"));
	Иначе
		ШаблонЗаголовка = СтрЗаменить(ШаблонЗаголовка, "{Состояние}", ?(Объект.Выполнена, Нстр("ru = '(выполнена)'; en = '(completed)'"), Нстр("ru = '(не выполнена)'; en = '(not completed)'")));
	КонецЕсли;	
	
	ЭтаФорма.Заголовок = ШаблонЗаголовка;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать сотрудника презентации на сервере
//
// Параметры:
//  КлиентСсылка				 - 	 - 
//  НазанчитьОсновногоМенеджера	 - 	 - 
//
Процедура ЗаписатьСотрудникаПрезентацииНаСервере(Знач КлиентСсылка, Знач НазанчитьОсновногоМенеджера = Ложь)
	
	КлиентОбъект = КлиентСсылка.ПолучитьОбъект();
	КлиентОбъект.СотрудникПрезентации = ПараметрыСеанса.ТекущийСотрудник;
	Если НазанчитьОсновногоМенеджера Тогда 
		КлиентОбъект.Менеджер = КлиентОбъект.СотрудникПрезентации;
	КонецЕсли;	
	Попытка
		КлиентОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Записать в журнал все параметры
//
Процедура ЗаписатьВЖурналВсеПараметры(Знач КонтрагентУказан)
	
	// Сформируем описание
	КомментарийОшибки = СтрШаблон(
	НСтр("ru='Нажатие на гиперссылку ""Дополнить информацию по клиенту"".
	|
	|Задача: %1
	|Клиент (ЗадачаПредмет) + его тип: %2
	|Статус клиента (на форме): %3
	|Статус клиента (текущий): %4
	|
	|Вид взаимодействия: %5
	|Взаимодействие состоялось:	%6
	|
	|Исполнитель: %7.';
	|en='Pressing on hyperlink ""Complement information on the the client"".
	|
	|Task: %1
	|Client Task + its type: %2
	|Status client on form: %3
	|Status client current: %4
	|Type of interactions: %5
	|
	|Interaction was held: %6
	|
	|Perpetrator: %7.'"),
	Строка(Объект.Ссылка),
	Строка(Объект.ЗадачаПредмет) + " (" + Строка(ТипЗнч(Объект.ЗадачаПредмет)) + ")",
	Строка(ЭтотОбъект.СтатусКлиента),
	Строка(ПолучитьСтатусКонтрагента(Объект.ЗадачаПредмет)),
	Строка(Объект.ВидВзаимодействия),
	?(Объект.ВзаимодействиеСостоялось, НСтр("ru = 'Да'; en = 'Yes'"), НСтр("ru = 'Нет'; en = 'No'")),
	Строка(Объект.Исполнитель));
	
	ЗаписатьВЖурналНаСервере(КомментарийОшибки, Объект.Ссылка, КонтрагентУказан);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Записать в журнал на сервере
//
// Параметры:
//  КомментарийОшибки	 - 	 - 
//
Процедура ЗаписатьВЖурналНаСервере(Знач КомментарийОшибки, Знач ЗадачаСсылка, Знач КонтрагентУказан)

	ЗаписьЖурналаРегистрации("Бизнес-процессы и задачи(ВЫЯВЛЕНИЕ ОШИБКИ)" + КонтрагентУказан, УровеньЖурналаРегистрации.Информация, ЗадачаСсылка.Метаданные(), ЗадачаСсылка, КомментарийОшибки);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть тип взаимодействия
//
// Параметры:
//  ВидВзаимодействияСправочник	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьТипВзаимодействия(Знач ВидВзаимодействияСправочник) 
	
	Возврат ВидВзаимодействияСправочник.ВидВзаимодействия;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Получить представление ФИОСотрудника.
//
Функция ПолучитьПредставлениеФИОСотрудника(Сотрудник)
	
	Возврат Справочники.Сотрудники.ПредставлениеФИОСотрудника(Сотрудник);		
	
КонецФункции

&НаСервере
// Процедура - Переключатель срок период.
//
Процедура ПереключательСрокПериод()
	
	Если ЭтотОбъект.РежимПериода Тогда 
		Элементы.ЗадачаНазначеннаяДатаНачало.Видимость		= Истина;
		Элементы.ЗадачаНазначеннаяДатаНачалоВремя.Видимость	= Истина;		
		Элементы.ЗадачаНазначеннаяДата.Заголовок			= Нстр("ru = 'по'; en = 'to'");
	Иначе
		Элементы.ЗадачаНазначеннаяДатаНачало.Видимость		= Ложь;
		Элементы.ЗадачаНазначеннаяДатаНачалоВремя.Видимость	= Ложь;		
		Элементы.ЗадачаНазначеннаяДата.Заголовок 			= Нстр("ru = 'Дата'; en = 'Date'");
		
		Объект.ЗадачаНазначеннаяДатаНачало					= Дата(01,01,01);	
		ЗадачаНазначеннаяДатаНачалоВремя					= Дата(01,01,01);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переключатель срок период при изменении.
//
Процедура ПереключательСрокПериодПриИзменении(Элемент)
	
	ПереключательСрокПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаНазначеннаяДатаНачалоПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораВремениЗадачи("ЗадачаНазначеннаяДатаНачало");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаНазначеннаяДатаНачалоОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция ПроверитьПравильностьПериода()
	
	Флаг = истина;
	
	Если РежимПериода Тогда // период 
		Если  НЕ ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДатаНачало) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Укажите дату начала действия задачи.';en='Specify the date beginnings actions tasks.'"), ЭтотОбъект, "Объект.ЗадачаНазначеннаяДатаНачало");
			Флаг = ложь;
		КонецЕсли;
		
		 Если  НЕ ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Укажите дату начала действия задачи.';en='Specify the date beginnings actions tasks.'"), ЭтотОбъект, "Объект.ЗадачаНазначеннаяДата");
			Флаг = ложь;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДатаНачало) и ЗначениеЗаполнено(Объект.ЗадачаНазначеннаяДата)
			и Объект.ЗадачаНазначеннаяДатаНачало > Объект.ЗадачаНазначеннаяДата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Указан не верный период. Дата окончания не может быть меньше даты начала.';en='Invalid period specified. Date graduation cannot be less dates beginnings.'"));
			Флаг = ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Флаг;
КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ПоказатьИсполнителяФактического".
//
Процедура ПоказатьИсполнителяФактического(Команда)
	
	Если ЗначениеЗаполнено(Объект.ИсполнительФактический) Тогда		
		ПоказатьЗначение(,Объект.ИсполнительФактический);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Контрагент при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентНажатиеЗавершение(Объект.Контрагент, Неопределено);	
	
КонецПроцедуры

#КонецОбласти
